# Pandas Tutorial

In [2]:
# Importing pandas using conventional method
import pandas as pd

### 1. How to read a table using Pandas

In [3]:
orders = pd.read_table('http://bit.ly/chiporders')

#### Difference between read_table and read_csv methods of pandas is in the default params. The seperator is '\t' (tab) for read_table but ',' for read_csv.

In [4]:
# To get the first 5 rows of the dataset
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [5]:
# You can specify the number of rows that you want to see by specifying like this
orders.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [6]:
# To get the last rows of the dataset
orders.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

### 2. How to specify separator in Pandas read_table() method

In [8]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)

In [9]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [11]:
# Selecting a particular column or a series from a dataframe
# There are two ways - 
# 1. Dot operator - eg. users.occupation 
# 2. Using Bracket Notation - eg. users['occupation']
users.occupation.head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

In [12]:
users['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

Bracket notation will always work, whereas dot notation has limitations:
- Dot notation doesn't work if there are spaces in the Series name
- Dot notation doesn't work if the Series has the same name as a DataFrame method or attribute (like 'head' or 'shape')
- Dot notation can't be used to define the name of a new Series

##### In Pandas, Methods like read_table(), read_csv() end with parantheses whereas attributes do not for eg. .shape, .dtypes

### 3. How to check the datatypes of the columns in the Dataframe

In [15]:
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### 4. How to check for the size of the Dataframe

In [16]:
users.shape

(943, 5)

### 5. How to know the details of the Dataframe

In [17]:
# It provides the statistics summary
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [18]:
# To check for only object type colums 
users.describe(include=['object'])

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

### 6. How to rename the column names in the Dataframe

In [20]:
# Firstly how to see all the column names in the dataframe
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [26]:
# Columns of a Dataframe can be renamed using the following methods:
# 1. Dataframe.rename(columns= {'X': 'x', 'Y':'y'}, inplace=True)
users.rename(columns={'user_id': 'ID', 'age': 'Age'}, inplace=True)
users.columns

Index(['ID', 'Age', 'Gender', 'Occupation', 'Zip_Code'], dtype='object')

#### inplace=True - helps to perform the operation on the same object whereas inplace=False returns the copy of the object after applying the operation to it.

In [25]:
# 2. Specify a list of names of the columns and then set the Dataframe.columns = column_name_list 
users_cols = ['ID', 'Age', 'Gender', 'Occupation', 'Zip_Code']
users.columns = users_cols
users.columns

Index(['ID', 'Age', 'Gender', 'Occupation', 'Zip_Code'], dtype='object')

In [29]:
# 3. Replace the columns right when you are reading the data
users_cols = ['ID', 'Age', 'Gender', 'Occupation', 'Zip_Code']
users = pd.read_table('http://bit.ly/movieusers', header=None, names=users_cols)
users.columns

Index(['ID', 'Age', 'Gender', 'Occupation', 'Zip_Code'], dtype='object')

In [31]:
# Column names can be read as string and all string operations can then be applied easily
users.columns = users.columns.str.replace('_', ' ')
users.columns

Index(['ID', 'Age', 'Gender', 'Occupation', 'Zip Code'], dtype='object')

### 7. How to delete/drop a column from a Dataframe

In [33]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [37]:
users.columns

Index(['user_id', 'age', 'gender', 'occupation'], dtype='object')